relationships = {
    '生': {
        '木': '火',
        '火': '土',
        '土': '金',
        '金': '水',
        '水': '木'
    },
    '克': {
        '火': '金',
        '水': '火',
        '土': '水',
        '木': '土',
        '金': '木'
    }
}
gan_wuxing = {
    '甲': '木',
    '乙': '木',
    '丙': '火',
    '丁': '火',
    '戊': '土',
    '己': '土',
    '庚': '金',
    '辛': '金',
    '壬': '水',
    '癸': '水'
}

zhi_wuxing = {
    '子': '水',
    '丑': '土',
    '寅': '木',
    '卯': '木',
    '辰': '土',
    '巳': '火',
    '午': '火',
    '未': '土',
    '申': '金',
    '酉': '金',
    '戌': '土',
    '亥': '水'
}
wang_xiang_value = {
    '旺': 1.2,
    '相': 1.2,
    '休': 1,
    '囚': 0.8,
    '死': 0.8
}

hidden_gan_ratios = {
    '子': {'癸': 1},
    '丑': {'己': 0.5, '癸': 0.3, '辛': 0.2},
    '寅': {'甲': 0.6, '丙': 0.3, '戊': 0.1},
    '卯': {'乙': 1},
    '辰': {'戊': 0.5, '乙': 0.3, '癸': 0.2},
    '巳': {'丙': 0.6, '戊': 0.3, '庚': 0.1},
    '午': {'丁': 0.5, '己': 0.5},
    '未': {'乙': 0.2, '己': 0.5, '丁': 0.3},
    '申': {'庚': 0.6, '壬': 0.3, '戊': 0.1},
    '酉': {'辛': 1},
    '戌': {'戊': 0.5, '辛': 0.3, '丁': 0.2},
    '亥': {'壬': 0.7, '甲': 0.3}
}

zhi_seasons = {
    '寅': '春',
    '卯': '春',
    '辰': '春',
    '巳': '夏',
    '午': '夏',
    '未': '夏',
    '申': '秋',
    '酉': '秋',
    '戌': '秋',
    '亥': '冬',
    '子': '冬',
    '丑': '冬'
}
season_phases = {
    '春': {'木': '旺', '火': '相', '水': '休', '金': '囚', '土': '死'},
    '夏': {'火': '旺', '土': '相', '木': '休', '水': '囚', '金': '死'},
    '秋': {'金': '旺', '水': '相', '土': '休', '火': '囚', '木': '死'},
    '冬': {'水': '旺', '木': '相', '金': '休', '土': '囚', '火': '死'},
}

wuxing_relations = {
    '木': {'有利': ['木', '水'], '不利': ['火', '土', '金']},
    '火': {'有利': ['火', '木'], '不利': ['土', '金', '水']},
    '土': {'有利': ['土', '火'], '不利': ['金', '水', '木']},
    '金': {'有利': ['金', '土'], '不利': ['水', '木', '火']},
    '水': {'有利': ['水', '金'], '不利': ['木', '火', '土']}
}
gan_yinyang = {
    '甲': '阳',
    '乙': '阴',
    '丙': '阳',
    '丁': '阴',
    '戊': '阳',
    '己': '阴',
    '庚': '阳',
    '辛': '阴',
    '壬': '阳',
    '癸': '阴'
}

peiou_xingge = """1、日支为比肩者：行事稳健，做事果断，且能理性主动，但容易形成孤僻，与他人较合不来，有时会流于自私自利。
2、日支为劫财者：具有冒险患难，坚忍奋斗之精神，积极进取，有时易冲动，脾气较暴躁，有时也会自以为是。
3、日支为食神者：个性温文随和，为人宽容厚道，心地仁慈善良，但有时易隐藏缺点装斯文，流于固执心态。
4、日支为伤官者：看起来就是聪明锐利的样子，很有才气，很活泼，易善辩，但有时会很任性叛逆，且很自傲的样子。
5、日支为正财者：一生勤劳节俭，凡事任劳任怨，做事很踏实且保守，但容易苟且偷安，有时也会有怠惰行为。
6、日支为偏财者：个性慷慨多情，动作敏捷机伶，很重视友谊，但心态易虚荣，行为较浮华，易流于投机浪费现象。
7、日支为正官者：为人正派，正直，也能负责尽职，做事能循规蹈矩，但也易墨守成规，流于刻板严肃现象，最好能亲和一点。
8、日支为七杀者：个性较偏激，动作较积极，脾气较倔强又嫌暴躁点，但也容易有叛逆违规，流于极端霸道之现象。
9、日支为正印者：为人聪颖仁慈，个性稳重敦厚，总能逆来顺受，但容易缺乏进取之精神，流于消极现象。
10、日支为偏印者：一生精明干练，机灵，冷静，有理智，但容易有孤独冷漠，流于尖酸刻薄的现象。"""